planets_app/app/controllers/moon_controller.rb

SELECT "moons".* FROM "moons"
---
    def index
        @moons = Moon.all

SELECT  "moons".* FROM "moons" WHERE "moons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @moon = Moon.find(params[:id])