planets_app/app/controllers/planet_controller.rb

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @planet = Planet.find(params[:id])