planets_app/app/controllers/random_controller.rb

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
    def index
        @planet = Planet.find(rand(24))